In [8]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter
from itertools import combinations

import warnings
warnings.filterwarnings('ignore')

In [5]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
502,tt0243155,25000000,281929795,Bridget Jones's Diary,RenÃ©e Zellweger|Colin Firth|Hugh Grant|Gemma ...,Sharon Maguire,Health Warning: Adopting Bridget's lifestyle c...,Bridget Jonesâ€™s Diary is a romantic love sto...,97,Comedy|Romance|Drama,Miramax Films|Universal Pictures|Studio Canal|...,4/13/2001,6.5,2001
649,tt0960731,80000000,212874442,Bedtime Stories,Adam Sandler|Keri Russell|Guy Pearce|Courteney...,Adam Shankman,Whatever they dream up... he has to survive.,Skeeter Bronson is a down-on-his-luck guy who'...,99,Fantasy|Comedy|Family|Romance,Walt Disney Pictures|Happy Madison Productions...,12/24/2008,5.8,2008
635,tt0800039,30000000,105173115,Forgetting Sarah Marshall,Jason Segel|Kristen Bell|Mila Kunis|Russell Br...,Nicholas Stoller,"You lose some, you get some.",When Sarah Marshall dumps aspiring musician Pe...,111,Comedy|Romance|Drama,Universal Pictures|Apatow Productions,4/17/2008,6.3,2008
371,tt1228705,200000000,623933331,Iron Man 2,Robert Downey Jr.|Gwyneth Paltrow|Don Cheadle|...,Jon Favreau,"It's not the armor that makes the hero, but th...",With the world now aware of his dual life as t...,124,Adventure|Action|Science Fiction,Marvel Studios,4/28/2010,6.6,2010
933,tt0265459,12000000,52223306,One Hour Photo,Robin Williams|Connie Nielsen|Michael Vartan|E...,Mark Romanek,The things that we fear the most have already ...,"Sy ""the photo guy"" Parrish has lovingly develo...",96,Horror|Thriller,Fox Searchlight Pictures|Catch 23 Entertainment,8/21/2002,6.4,2002

In [4]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [6]:
answers = {} # создадим словарь для ответов

# тут другие ваши предобработки колонок например:

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...

In [21]:
data['Profit'] = data['revenue'] - data['budget'] # Добавили подработачный столбец Profit

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [16]:
answers['1'] = 'Pirates of the Caribbean: On Stranger Tides (tt1298650)'
# ищем фильм с максимальным бюджетом
res = data.sort_values('budget', ascending = False).head(1)
display(res['original_title'] + ' (' + res['imdb_id'] + ')')

723    Pirates of the Caribbean: On Stranger Tides (t...
dtype: object

ВАРИАНТ 2

In [0]:
# можно добавлять разные варианты решения

# 2. Какой из фильмов самый длительный (в минутах)?

In [55]:
answers['2'] = 'Gods and Generals (tt0279111)'
res = data.sort_values('runtime', ascending = False).head(1)
print(res['original_title'] + ' (' + res['imdb_id'] + ')')

1157    Gods and Generals (tt0279111)
dtype: object

# 3. Какой из фильмов самый короткий (в минутах)?

In [17]:
answers['3'] = 'Winnie the Pooh (tt1449283)'
res = data.sort_values('runtime').head(1)
print(res['original_title'] + ' (' + res['imdb_id'] + ')')

768    Winnie the Pooh (tt1449283)
dtype: object

# 4. Какова средняя длительность фильмов?

In [18]:
answers['4'] = '110.0'
# среднее значение по столбцу runtime
# mean - среднее арифметическое
round(data['runtime'].mean(), 0)
# 110

110.0

# 5. Каково медианное значение длительности фильмов?

In [19]:
answers['5'] = '107.0'
# ищем медиану среди значений стобца 'runtime'
data['runtime'].median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [22]:
answers['6'] = 'Avatar (tt0499549)'
# сортируем столбец 'Profit' - размер полученной прибыли
data[['original_title', 'imdb_id', 'Profit']].sort_values(['Profit'],  ascending=False).head(1)

    original_title    imdb_id      Profit
239         Avatar  tt0499549  2544505847

# 7. Какой фильм самый убыточный?

In [23]:
answers['7'] = 'The Lone Ranger (tt1210819)'
data[['original_title', 'imdb_id', 'Profit']].sort_values(['Profit'],  ascending=True).head()

                    original_title    imdb_id     Profit
1245               The Lone Ranger  tt1210819 -165710090
1616                     The Alamo  tt0318974 -119180039
809                Mars Needs Moms  tt1305591 -111007242
958   The Adventures of Pluto Nash  tt0180052  -92896027
1464                  Flushed Away  tt0424095  -84540684

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [24]:
answers['8'] = '1478'
data[data['Profit'] > 0]['Profit'].count()

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [25]:
answers['9'] = 'The Dark Knight (tt0468569)'
data[data['release_year'] == 2008][['original_title', 'imdb_id', 'revenue']].sort_values(['revenue'],  ascending=False).head(1)

      original_title    imdb_id     revenue
599  The Dark Knight  tt0468569  1001921825

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [26]:
answers['10'] = 'The Lone Ranger (tt1210819)'
data[(data['release_year'] >= 2012) & (data['release_year'] <= 2014)][['release_year', 'original_title', 'imdb_id', 'Profit']].sort_values(['Profit'],  ascending=True).head(1)

      release_year   original_title    imdb_id     Profit
1245          2013  The Lone Ranger  tt1210819 -165710090

# 11. Какого жанра фильмов больше всего?

In [28]:
answers['11'] = 'Drama'
res = data[['original_title', 'genres']]
res['genres'] = res['genres'].str.split('|')
# Создаем новые столбцы под каждый из жанров (разворачиваем список на столцы)
# для этого строим серию 
# res['genres'].apply(pd.Series).stack().reset_index(1, drop=True)
# которая разбивает каждый элемент в списках на новый столбец.
# .stack() складывает эти столбцы в один столбец, сохраняя инфу об индексе
# .reset_index(1, drop=True) сбрасывает уровень 1 индекса и отбрасываем его
# затем оборачиваем эту серию
# pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True), name='genres1'))
# для присоединения к нашему дата сэту, для этого добавляем стобец name='genres1'
# соединяем нашу серию жанров с исходным датафреймом
# res.join(pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True), 
#                      name='genres1'))
dummies_df = res.join(pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='genres1'))
dummies_df['genres1'].value_counts()

Drama              782
Comedy             683
Thriller           596
Action             582
Adventure          415
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            222
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             19
Documentary          8
Foreign              2
Name: genres1, dtype: int64

ВАРИАНТ 2

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [29]:
answers['12'] = 'Drama'
res = data
res['Profit'] = res['revenue'] - res['budget']
res = res[res['Profit'] >= 0][['original_title', 'Profit', 'genres']].sort_values(['Profit'])
res['genres'] = res['genres'].str.split('|')

# Создаем новые столбцы под каждый из жанров
# для этого строим серию 
# res['genres'].apply(pd.Series).stack().reset_index(1, drop=True)
# которая разбивает каждый элемент в списках на новый столбец.
# .stack() складывает эти столбцы в один столбец, сохраняя инфу об индексе
# .reset_index(1, drop=True) сбрасывает уровень 1 индекса и отбрасываем его
# затем оборачиваем эту серию
# pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True), name='genres1'))
# для присоединения к нашему дата сэту, для этого добавляем стобец name='genres1'

# соединяем нашу серию жанров с исходным датафреймом
# res.join(pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True), 
#                      name='genres1'))
dummies_df = res.join(pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='genres1'))
dummies_df['genres1'].value_counts()

Drama              560
Comedy             551
Thriller           446
Action             444
Adventure          337
Romance            242
Crime              231
Family             226
Science Fiction    195
Fantasy            188
Horror             150
Animation          120
Mystery            119
Music               47
History             46
War                 41
Western             12
Documentary          7
Name: genres1, dtype: int64

# 13. У какого режиссера самые большие суммарные кассовые сбооры?

In [30]:
answers['13'] = 'Peter Jackson'
res = data[['original_title', 'revenue', 'director']]
res['director'] = res['director'].str.split('|')

dummies_df = res.join(pd.Series(res['director'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='director1'))
dummies_df.pivot_table(index='director1', aggfunc= {'revenue':sum}).sort_values(['revenue'], ascending=False)

                      revenue
director1
Peter Jackson      6490593685
Christopher Nolan  4167548502
David Yates        4154295625
Michael Bay        3886938960
J.J. Abrams        3579169916
...                       ...
David MichÃ´d         2295423
Steven Shainberg      2281089
Paul Schrader         2062066
Keanu Reeves          2054941
Simon Hunter          2033165

[997 rows x 1 columns]

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [31]:
answers['14'] = 'Robert Rodriguez'
res = data[['original_title', 'genres', 'director']]
res['director'] = res['director'].str.split('|')
res['genres'] = res['genres'].str.split('|')

dummies_df = res.join(pd.Series(res['genres'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='genres1'))
dummies_df = dummies_df[dummies_df['genres1'] == 'Action']

dummies_d = dummies_df.join(pd.Series(dummies_df['director'].apply(pd.Series).stack().reset_index(1, drop=True),
                      name='director1'))
dummies_d['director1'].value_counts()

Robert Rodriguez      9
Michael Bay           7
Paul W.S. Anderson    7
Ridley Scott          6
Antoine Fuqua         6
                     ..
Vic Armstrong         1
David Koepp           1
Bruce Hunt            1
Geoffrey Sax          1
John McTiernan        1
Name: director1, Length: 364, dtype: int64

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [32]:
answers['15'] = 'Chris Hemsworth'
res = data[['original_title', 'revenue', 'cast', 'release_year']]
res['cast'] = res['cast'].str.split('|')
res = res[res['release_year'] == 2012]

dummies_df = res.join(pd.Series(res['cast'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='cast1'))
dummies_df.groupby(['cast1']).sum().sort_values(['revenue'], ascending=False)

                      revenue  release_year
cast1
Chris Hemsworth    2027450773          8048
Denis Leary        1629460639          4024
Anne Hathaway      1522851057          4024
Robert Downey Jr.  1519557910          2012
Mark Ruffalo       1519557910          2012
...                       ...           ...
Michael Nyqvist       3428048          2012
Danny Huston          2106557          2012
Josh Lucas            2106557          2012
Sami Gayle            2106557          2012
Nicolas Cage          2106557          2012

[466 rows x 2 columns]

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [33]:
answers['16'] = 'Matt Damon'
res = data[['original_title', 'budget', 'cast']]
res['cast'] = res['cast'].str.split('|')
# отберем высокобюджетные фильмы
i_mean = data['budget'].mean()
res = res[res['budget'] > i_mean]


dummies_df = res.join(pd.Series(res['cast'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='cast1'))
dummies_df['cast1'].value_counts()

Matt Damon            18
Adam Sandler          17
Angelina Jolie        16
Eddie Murphy          15
Tom Cruise            15
                      ..
Jake Cherry            1
StÃ©phanie Lagarde     1
Kristen Johnston       1
Nelly                  1
Ian Holm               1
Name: cast1, Length: 1505, dtype: int64

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [34]:
answers['17'] = 'Action'
res = data[['original_title', 'genres', 'cast']]
res['cast'] = res['cast'].str.split('|')
res['genres'] = res['genres'].str.split('|')

dummies_df = res.join(pd.Series(res['cast'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='cast1'))
dummies_df = dummies_df[dummies_df['cast1'] == 'Nicolas Cage']

dummies_d = dummies_df.join(pd.Series(dummies_df['genres'].apply(pd.Series).stack().reset_index(1, drop=True),
                      name='genres1'))
dummies_d['genres1'].value_counts()

Action             17
Thriller           15
Drama              12
Crime              10
Fantasy             8
Adventure           7
Comedy              6
Science Fiction     4
Animation           3
Family              3
Mystery             3
History             2
War                 1
Horror              1
Romance             1
Name: genres1, dtype: int64

# 18. Самый убыточный фильм от Paramount Pictures

In [35]:
answers['18'] = 'K-19: The Widowmaker (tt0267626)'
res = data
res['Profit'] = res['revenue'] - res['budget']
res['production_companies1'] = res['production_companies'].str.split('|')

dummies_df = res.join(pd.Series(res['production_companies1'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='production_companies2'))
dummies_df = dummies_df[dummies_df['production_companies2'] == 'Paramount Pictures'][['original_title', 'imdb_id', 'Profit', 'production_companies2']].sort_values(['Profit'])
dummies_df.head()

            original_title    imdb_id    Profit production_companies2
925   K-19: The Widowmaker  tt0267626 -64831034    Paramount Pictures
1123              Timeline  tt0300556 -60519261    Paramount Pictures
1722                  Next  tt0435705 -51788987    Paramount Pictures
1623                 Alfie  tt0375173 -46604061    Paramount Pictures
1631               Twisted  tt0315297 -24805000    Paramount Pictures

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [41]:
answers['19'] = '2015'
res = data
res['Profit'] = res['revenue'] - res['budget']
res[['original_title', 'imdb_id', 'release_year', 'Profit']].groupby(['release_year']).sum().sort_values(['Profit'],  
    ascending=False).head()

                   Profit
release_year
2015          18668572378
2014          16397812953
2012          16077001687
2013          15243179791
2011          14730241341

# 20. Какой самый прибыльный год для студии Warner Bros?

In [40]:
answers['20'] = '2014'
res = data
res['Profit'] = res['revenue'] - res['budget']
res['production_companies1'] = res['production_companies'].str.split('|')

dummies_df = res.join(pd.Series(res['production_companies1'].apply(pd.Series).stack().reset_index(1, drop=True),
                     name='production_companies2'))
dummies_df = dummies_df[dummies_df['production_companies2'].str.contains('Warner Bros')][['original_title', 
                                                                                          'Profit', 'release_year', 
                                                                                          'production_companies2']]
dummies_df.groupby(['release_year']).sum().sort_values(['Profit'],  ascending=False).head()

                  Profit
release_year
2014          2292949646
2007          2201675217
2008          2134595031
2010          1974712985
2011          1871393682

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [42]:
answers['21'] = 'Сентябрь'
res = data
res['month'] = pd.DatetimeIndex(res['release_date']).month
res[['imdb_id', 'month']].groupby(['month']).count().sort_values('imdb_id',  ascending=False).head()

       imdb_id
month
9          227
12         190
10         186
8          161
3          156

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [43]:
answers['22'] = '450'
res = data
res['month'] = pd.DatetimeIndex(res['release_date']).month
res[(res['month'] >= 6) & (res['month'] <= 8)][['imdb_id', 'month']].groupby(['month']).count().sum()

imdb_id    450
dtype: int64

# 23. Для какого режиссера зима – самое продуктивное время года?

In [45]:
answers['23'] = 'Peter Jackson'
res = data[['director', 'release_date']]
res['month'] = pd.DatetimeIndex(res['release_date']).month
res['director'] = res['director'].str.split('|')
res = res[(res['month'] <= 2) | (res['month'] == 12)]

res = res.join(pd.Series(res['director'].apply(pd.Series).stack().reset_index(1, drop=True),
                        name='director1'))
res[['director1', 'month']].groupby(['director1']).count().sort_values('month',  ascending=False).head()

                   month
director1
Peter Jackson          7
Steven Soderbergh      6
Clint Eastwood         6
Shawn Levy             4
Adam Shankman          4

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [47]:
# использовал две попытки и обе не вырные
answers['24'] = 'Four By Two Productions'
res = data[['production_companies', 'original_title']]
res['production_companies'] = res['production_companies'].str.split('|')
res['len'] = res['original_title'].str.len()
res = res.join(pd.Series(res['production_companies'].apply(pd.Series).stack().reset_index(1, drop=True),
                        name='production_companies1'))
res.sort_values('len',  ascending=False).head()

,production_companies,original_title,len,production_companies1
1448,"[Twentieth Century Fox Film Corporation, Four ...",Borat: Cultural Learnings of America for Make ...,83,Four By Two Productions
1448,"[Twentieth Century Fox Film Corporation, Four ...",Borat: Cultural Learnings of America for Make ...,83,Twentieth Century Fox Film Corporation
1314,"[Walt Disney, Walden Media]","The Chronicles of Narnia: The Lion, the Witch ...",62,Walden Media
1314,"[Walt Disney, Walden Media]","The Chronicles of Narnia: The Lion, the Witch ...",62,Walt Disney
219,"[Walt Disney Pictures, 21 Laps Entertainment, ...","Alexander and the Terrible, Horrible, No Good,...",59,Walt Disney Pictures

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [49]:
answers['25'] = 'Midnight Picture Show'
res = data[['production_companies', 'overview']]
res['production_companies'] = res['production_companies'].str.split('|')
res['word'] = res['overview'].map(lambda x: len(x.split(' ')))

res = res.join(pd.Series(res['production_companies'].apply(pd.Series).stack().reset_index(1, drop=True),
                        name='production_companies1'))
res.groupby(['production_companies1']).mean().sort_values('word',  ascending=False).head()

                                   word
production_companies1
Midnight Picture Show             175.0
Heineken Branded Entertainment    161.0
Room 9 Entertainment              161.0
98 MPH Productions                159.0
Brookwell-McNamara Entertainment  156.0

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [52]:
answers['26'] = 'Inside Out, The Dark Knight, 12 Years a Slave'
res = data[['original_title', 'vote_average']]

quant = res.sort_values('vote_average',  ascending=False).quantile(0.99)[0]
res = res[res['vote_average'] >= quant]
res.sort_values('vote_average',  ascending=False).head(7)

          original_title  vote_average
599      The Dark Knight           8.1
9             Inside Out           8.0
34                  Room           8.0
118         Interstellar           8.0
125   The Imitation Game           8.0
370            Inception           7.9
1191    12 Years a Slave           7.9

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [53]:
answers['27'] = 'Daniel Radcliffe', 'Rupert Grint'
res = data[['cast', 'original_title']]
res['i_cast'] = res['cast'].apply(lambda x: list(combinations(str(x).split('|'), 2)))
c = Counter()
for word in res['i_cast'].sum():
    c[word] += 1
c.most_common(5)

[(('Daniel Radcliffe', 'Rupert Grint'), 8),
 (('Daniel Radcliffe', 'Emma Watson'), 8),
 (('Rupert Grint', 'Emma Watson'), 7),
 (('Ben Stiller', 'Owen Wilson'), 6),
 (('Johnny Depp', 'Helena Bonham Carter'), 6)]

# Submission

In [56]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'23': 'Peter Jackson',
 '25': 'Midnight Picture Show',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave',
 '27': ('Daniel Radcliffe', 'Rupert Grint'),
 '1': 'Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '3': 'Winnie the Pooh (tt1449283)',
 '4': '110.0',
 '5': '107.0',
 '6': 'Avatar (tt0499549)',
 '7': 'The Lone Ranger (tt1210819)',
 '8': '1478',
 '9': 'The Dark Knight (tt0468569)',
 '10': 'The Lone Ranger (tt1210819)',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker (tt0267626)',
 '19': '2015',
 '20': '2014',
 '21': 'Сентябрь',
 '22': '450',
 '24': 'Four By Two Productions',
 '2': 'Gods and Generals (tt0279111)'}

In [57]:
# и убедиться что ни чего не пропустил)
len(answers)

27